GopalSaraf/Practicals/PSDL/include/proc/pic16f17115.h
// Register: CRCCON1
#define CRCCON1 CRCCON1
extern volatile unsigned char           CRCCON1             __at(0x1CA3);
#ifndef _LIB_BUILD
asm("CRCCON1 equ 01CA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLEN                   :5;
    };
    struct {
        unsigned PLEN0                  :1;
        unsigned PLEN1                  :1;
        unsigned PLEN2                  :1;
        unsigned PLEN3                  :1;
        unsigned PLEN4                  :1;
    };
} CRCCON1bits_t;
extern volatile CRCCON1bits_t CRCCON1bits __at(0x1CA3);
// bitfield macros
#define _CRCCON1_PLEN_POSN                                  0x0
#define _CRCCON1_PLEN_POSITION                              0x0
#define _CRCCON1_PLEN_SIZE                                  0x5
#define _CRCCON1_PLEN_LENGTH                                0x5
#define _CRCCON1_PLEN_MASK                                  0x1F
#define _CRCCON1_PLEN0_POSN                                 0x0
#define _CRCCON1_PLEN0_POSITION                             0x0
#define _CRCCON1_PLEN0_SIZE                                 0x1
#define _CRCCON1_PLEN0_LENGTH                               0x1
#define _CRCCON1_PLEN0_MASK                                 0x1
#define _CRCCON1_PLEN1_POSN                                 0x1
#define _CRCCON1_PLEN1_POSITION                             0x1
#define _CRCCON1_PLEN1_SIZE                                 0x1
#define _CRCCON1_PLEN1_LENGTH                               0x1
#define _CRCCON1_PLEN1_MASK                                 0x2
#define _CRCCON1_PLEN2_POSN                                 0x2
#define _CRCCON1_PLEN2_POSITION                             0x2
#define _CRCCON1_PLEN2_SIZE                                 0x1
#define _CRCCON1_PLEN2_LENGTH                               0x1
#define _CRCCON1_PLEN2_MASK                                 0x4
#define _CRCCON1_PLEN3_POSN                                 0x3
#define _CRCCON1_PLEN3_POSITION                             0x3
#define _CRCCON1_PLEN3_SIZE                                 0x1
#define _CRCCON1_PLEN3_LENGTH                               0x1
#define _CRCCON1_PLEN3_MASK                                 0x8
#define _CRCCON1_PLEN4_POSN                                 0x4
#define _CRCCON1_PLEN4_POSITION                             0x4
#define _CRCCON1_PLEN4_SIZE                                 0x1
#define _CRCCON1_PLEN4_LENGTH                               0x1
#define _CRCCON1_PLEN4_MASK                                 0x10

// Register: CRCCON2
#define CRCCON2 CRCCON2
extern volatile unsigned char           CRCCON2             __at(0x1CA4);
#ifndef _LIB_BUILD
asm("CRCCON2 equ 01CA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLEN                   :5;
    };
    struct {
        unsigned DLEN0                  :1;
        unsigned DLEN1                  :1;
        unsigned DLEN2                  :1;
        unsigned DLEN3                  :1;
        unsigned DLEN4                  :1;
    };
} CRCCON2bits_t;
extern volatile CRCCON2bits_t CRCCON2bits __at(0x1CA4);
// bitfield macros
#define _CRCCON2_DLEN_POSN                                  0x0
#define _CRCCON2_DLEN_POSITION                              0x0
#define _CRCCON2_DLEN_SIZE                                  0x5
#define _CRCCON2_DLEN_LENGTH                                0x5
#define _CRCCON2_DLEN_MASK                                  0x1F
#define _CRCCON2_DLEN0_POSN                                 0x0
#define _CRCCON2_DLEN0_POSITION                             0x0
#define _CRCCON2_DLEN0_SIZE                                 0x1
#define _CRCCON2_DLEN0_LENGTH                               0x1
#define _CRCCON2_DLEN0_MASK                                 0x1
#define _CRCCON2_DLEN1_POSN                                 0x1
#define _CRCCON2_DLEN1_POSITION                             0x1
#define _CRCCON2_DLEN1_SIZE                                 0x1
#define _CRCCON2_DLEN1_LENGTH                               0x1
#define _CRCCON2_DLEN1_MASK                                 0x2
#define _CRCCON2_DLEN2_POSN                                 0x2
#define _CRCCON2_DLEN2_POSITION                             0x2
#define _CRCCON2_DLEN2_SIZE                                 0x1
#define _CRCCON2_DLEN2_LENGTH                               0x1
#define _CRCCON2_DLEN2_MASK                                 0x4
#define _CRCCON2_DLEN3_POSN                                 0x3
#define _CRCCON2_DLEN3_POSITION                             0x3
#define _CRCCON2_DLEN3_SIZE                                 0x1
#define _CRCCON2_DLEN3_LENGTH                               0x1
#define _CRCCON2_DLEN3_MASK                                 0x8
#define _CRCCON2_DLEN4_POSN                                 0x4
#define _CRCCON2_DLEN4_POSITION                             0x4
#define _CRCCON2_DLEN4_SIZE                                 0x1
#define _CRCCON2_DLEN4_LENGTH                               0x1
#define _CRCCON2_DLEN4_MASK                                 0x10

// Register: ADLTH
#define ADLTH ADLTH
extern volatile unsigned short          ADLTH               __at(0x1D0C);
#ifndef _LIB_BUILD
asm("ADLTH equ 01D0Ch");
#endif

// Register: ADLTHL
#define ADLTHL ADLTHL
extern volatile unsigned char           ADLTHL              __at(0x1D0C);
#ifndef _LIB_BUILD
asm("ADLTHL equ 01D0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LTH                    :8;
    };
    struct {
        unsigned ADLTH0                 :1;
        unsigned ADLTH1                 :1;
        unsigned ADLTH2                 :1;
        unsigned ADLTH3                 :1;
        unsigned ADLTH4                 :1;
        unsigned ADLTH5                 :1;
        unsigned ADLTH6                 :1;
        unsigned ADLTH7                 :1;
    };
    struct {
        unsigned ADLTH                  :8;
    };
    struct {
        unsigned LTH0                   :1;
        unsigned LTH1                   :1;
        unsigned LTH2                   :1;
        unsigned LTH3                   :1;
        unsigned LTH4                   :1;
        unsigned LTH5                   :1;
        unsigned LTH6                   :1;
        unsigned LTH7                   :1;
    };
} ADLTHLbits_t;
